[
  {
    "id": 1,
    "image": "https://play-lh.googleusercontent.com/FDRKka66TQRZjlR1_StX3x9Gxs6UtWEF5rfdNJEs_rDci28TOUrsNxYqxXzL5KrITQ=s128-rw",
    "title": "PUBG Mobile",
    "companyName": "Tencent Games",
    "description": "Battle Royale game with realistic graphics and intense multiplayer matches. Explore a wide variety of weapons, vehicles, and strategies to survive till the end. Join friends or play solo in fast-paced matches across dynamic maps. Experience seasonal events, exclusive skins, and exciting challenges. Participate in ranked gameplay to climb the leaderboard and showcase your skills. Stay engaged with regular updates and tournaments that keep the action fresh. Customize your character appearance and loadouts to suit your style. Test your reflexes and teamwork in tense firefights.",
    "size": 2300,
    "reviews": 98000000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 72000000 }
    ]
  },
  {
    "id": 2,
    "image": "https://play-lh.googleusercontent.com/Ozmaqzz_vAlsyvGO-Sv6MYhZGzh_uWqXcNg3GXV6Qsvlz-sEAyO6RATTWhgvcGO7jgu1cQV7H5RWVsgZvbqX=s128-rw",
    "title": "Free Fire",
    "companyName": "Garena",
    "description": "Fast-paced battle royale experience optimized for all devices. Engage in thrilling 10-minute matches with a variety of maps and game modes. Customize characters with unique abilities, outfits, and accessories. Form squads and communicate with teammates for strategic victories. Take part in seasonal events, special challenges, and ranked modes. Enjoy constant updates with new content, rewards, and features that keep gameplay exciting. Collect rare items and upgrade weapons to gain an edge over opponents. Participate in global tournaments to test your skills.",
    "size": 700,
    "reviews": 72000000,
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 3100000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 52000000 }
    ]
  },
  {
    "id": 3,
    "image": "https://play-lh.googleusercontent.com/KCMTYuiTrKom4Vyf0G4foetVOwhKWzNbHWumV73IXexAIy5TTgZipL52WTt8ICL-oIo=w480-h960-rw",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "description": "Connect with friends, share updates, and join communities globally. Explore news feeds, watch videos, and interact with posts through likes, comments, and shares. Create and join groups that match your interests. Participate in live events, marketplace transactions, and story sharing. Stay informed with trending topics and notifications from friends and favorite pages. Customize your profile and privacy settings for a safe and personalized experience. Follow pages, celebrities, and brands to get updates instantly. Discover events nearby and RSVP to social gatherings seamlessly.",
    "size": 200,
    "reviews": 140000000,
    "ratingAvg": 4.1,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 12000000 },
      { "name": "4 star", "count": 28000000 },
      { "name": "5 star", "count": 90000000 }
    ]
  },
  {
    "id": 4,
    "image": "https://play-lh.googleusercontent.com/VRMWkE5p3CkWhJs6nv-9ZsLAs1QOg5ob1_3qg-rckwYW7yp1fMrYZqnEFpk0IoVP4LM=s96-rw",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "description": "Share your photos, stories, and reels with the world. Explore content from friends, celebrities, and creators worldwide. Interact through likes, comments, and direct messages. Discover trending hashtags and topics to stay up-to-date. Use creative filters, effects, and editing tools to enhance your posts. Watch IGTV videos and participate in live streams. Join a global community and express yourself visually in new ways every day. Follow inspiring accounts and save posts for later reference. Participate in fun challenges and community-driven content.",
    "size": 180,
    "reviews": 100000000,
    "ratingAvg": 4.5,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 62000000 }
    ]
  },
  {
    "id": 5,
    "image": "https://play-lh.googleusercontent.com/6am0i3walYwNLc08QOOhRJttQENNGkhlKajXSERf3JnPVRQczIyxw2w3DxeMRTOSdsY=s96-rw",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "Watch, upload, and share videos from creators worldwide. Subscribe to channels, create playlists, and comment on content. Discover trending videos, tutorials, music, and entertainment. Participate in live streams and premieres. Use features like YouTube Shorts and YouTube Premium for enhanced viewing. Explore personalized recommendations based on your interests. Engage with communities through likes, shares, and discussions. Access videos on any device and offline downloads. Monetize your content through ads and membership programs.",
    "size": 150,
    "reviews": 150000000,
    "ratingAvg": 4.6,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 120000000 }
    ]
  },
  {
    "id": 6,
    "image": "https://play-lh.googleusercontent.com/sUXm7uP_c8ysJqwOkbmIpBnDee_6lJJCPODRP4DOCuFWp9Gq-_X_oqY9NTJ2OIEGtQ=w480-h960-rw",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "description": "Create and watch short-form videos that entertain and inspire. Follow trending hashtags, effects, and soundtracks to join the global community. Share your content with followers or keep it private. Participate in challenges, duets, and collaborations. Discover personalized recommendations based on your interactions. Engage with live streams, gifts, and virtual rewards. Explore educational, comedic, and artistic videos. Stay up-to-date with regular app updates introducing new features. Connect with creators worldwide effortlessly.",
    "size": 350,
    "reviews": 90000000,
    "ratingAvg": 4.4,
    "downloads": 3000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 21000000 },
      { "name": "5 star", "count": 55000000 }
    ]
  },
  {
    "id": 7,
    "image": "https://play-lh.googleusercontent.com/iDgVznPhzb5rXDnNVDC0wwlTc_t5pDcmcPziJkLjk8wySwPqNeI5N8wVRPHQNRNydQ=w480-h960-rw",
    "title": "Pathao",
    "companyName": "Pathao Ltd.",
    "description": "Bangladesh's super app for rides, food delivery, and courier services. Book rides conveniently across the city with real-time tracking. Order food from local restaurants with seamless payment options. Send parcels and track deliveries efficiently. Access digital wallets and payment services for easy transactions. Explore promotional offers and discounts regularly. Rate and review drivers, restaurants, and delivery services. Stay connected with in-app support and notifications. Participate in app campaigns and loyalty programs for rewards.",
    "size": 120,
    "reviews": 2000000,
    "ratingAvg": 4.3,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1400000 }
    ]
  },
  {
    "id": 8,
    "image": "https://play-lh.googleusercontent.com/TS1WqJu0eqQ5RkGw5TkVEJ7fxPLyKgDu0UHc7E9Av5dntMvB3uVWFm7_bu0jkFFla20=w480-h960-rw",
    "title": "10 Minute School",
    "companyName": "Robi Axiata Ltd.",
    "description": "Bangladesh’s leading online education platform for students and professionals. Access video lessons and tutorials covering various subjects and topics. Take quizzes and assessments to reinforce your learning. Follow courses designed by experienced teachers and experts. Prepare for exams, competitions, and skill certifications efficiently. Track your progress and achievements through personalized dashboards. Participate in live classes, workshops, and interactive sessions. Engage with fellow learners through discussion forums and groups. Receive tips, study guides, and educational resources for all levels.",
    "size": 95,
    "reviews": 1500000,
    "ratingAvg": 4.8,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 1170000 }
    ]
  },
  {
    "id": 9,
    "image": "https://play-lh.googleusercontent.com/Ma_HEbK1LzEoayR0tE0ZXqLopug69-dPspfCV36zzHOSuC0_i6mu5ulKz1eY7en-UM4=w480-h960-rw",
    "title": "Photomath",
    "companyName": "Photomath, Inc.",
    "description": "Scan and solve math problems instantly with step-by-step solutions. Understand complex problems through animated explanations. Learn multiple solving methods for better comprehension. Access practice exercises and challenges for improvement. Track your learning progress and areas to focus on. Explore topics from basic arithmetic to advanced calculus. Use it as a homework help tool or self-study guide. Gain confidence in problem-solving through interactive guidance. Receive explanations in multiple languages and formats.",
    "size": 60,
    "reviews": 12000000,
    "ratingAvg": 4.7,
    "downloads": 100000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 8500000 }
    ]
  },
  {
    "id": 10,
    "image": "https://play-lh.googleusercontent.com/tw_coGKgk1K_zO-Ypf9zBKV1s-KT3dYN1MIUxIqtnbfmON5x_YmuoAr31gE4oSfJHNtA-aStTd-qe9R8S6NVyA=w480-h960-rw",
    "title": "Duolingo",
    "companyName": "Duolingo, Inc.",
    "description": "Learn languages for free through fun, bite-sized lessons. Practice reading, writing, speaking, and listening skills in a gamified environment. Track your daily streaks and learning progress. Access courses in multiple languages with tailored learning paths. Participate in quizzes and challenges to reinforce knowledge. Engage with a global community of learners. Use Duolingo Stories and podcasts for immersive practice. Gain badges and rewards to motivate consistent learning. Explore tips and explanations to master grammar and vocabulary.",
    "size": 90,
    "reviews": 14000000,
    "ratingAvg": 4.7,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 9500000 }
    ]
  },
  {
    "id": 11,
    "image": "https://play-lh.googleusercontent.com/kMofEFLjobZy_bCuaiDogzBcUT-dz3BBbOrIEjJ-hqOabjK8ieuevGe6wlTD15QzOqw=w480-h960-rw",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "description": "Network professionally and discover job opportunities. Build and showcase your professional profile. Connect with colleagues, industry experts, and recruiters. Follow companies, join groups, and participate in discussions. Access personalized job recommendations and apply directly. Share posts, achievements, and insights with your network. Receive endorsements and recommendations to boost credibility. Engage in learning courses to develop new skills. Stay informed about industry trends and company updates.",
    "size": 140,
    "reviews": 8500000,
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2200000 },
      { "name": "5 star", "count": 4600000 }
    ]
  },
  {
    "id": 12,
    "image": "https://play-lh.googleusercontent.com/A-Rnrh0J7iKmABskTonqFAANRLGTGUg_nuE4PEMYwJavL3nPt5uWsU2WO_DSgV_mOOM=w480-h960-rw",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "description": "Share your thoughts, follow topics, and connect with communities. Post tweets, reply to discussions, and retweet content. Explore trending hashtags, news, and topics globally. Follow public figures, organizations, and friends to stay updated. Engage in conversations, polls, and live events. Customize your profile and notifications for a tailored experience. Access X Spaces for live audio interactions. Discover X communities for shared interests. Stay informed with instant updates on breaking news and trends.",
    "size": 170,
    "reviews": 90000000,
    "ratingAvg": 4.0,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 50000000 }
    ]
  },
  {
    "id": 13,
    "image": "https://play-lh.googleusercontent.com/KxeSAjPTKliCErbivNiXrd6cTwfbqUJcbSRPe_IBVK_YmwckfMRS1VIHz-5cgT09yMo=w480-h960-rw",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Share moments instantly and chat with friends creatively. Send photos, videos, and text messages that disappear after viewing. Explore Snap Map to see friends' locations and discover events. Use fun lenses, filters, and AR effects. Create and watch Stories, Spotlight videos, and Discover content. Participate in group chats and video calls. Collect and exchange Snapstreaks and trophies with friends. Stay connected with real-time notifications and updates. Protect privacy with customizable settings and security features.",
    "size": 160,
    "reviews": 70000000,
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 17000000 },
      { "name": "5 star", "count": 42000000 }
    ]
  },
  {
    "id": 14,
    "image": "https://play-lh.googleusercontent.com/GBaWlaevq4CA0xN13QYlIseEmL2inzVEx9z3HBBJPNbIQmlZLgA9lj-pfbY4h3XVa5Xvuns3ORaWSEvk8IbSDyQ=s96-rw",
    "title": "Call of Duty: Mobile",
    "companyName": "Activision Publishing",
    "description": "Multiplayer FPS game featuring iconic maps and modes. Engage in classic multiplayer battles or battle royale mode. Customize weapons, characters, and loadouts for strategic gameplay. Participate in ranked matches, seasonal events, and tournaments. Explore new maps, game modes, and limited-time challenges regularly. Communicate with teammates for coordinated tactics. Collect achievements, rewards, and skins to enhance your experience. Experience realistic graphics, immersive audio, and responsive controls. Join clans and compete globally for leaderboard dominance.",
    "size": 2200,
    "reviews": 64000000,
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 42000000 }
    ]
  },
  {
    "id": 15,
    "image": "https://play-lh.googleusercontent.com/1CRcUfmtwvWxT2g-xJF8s9_btha42TLi6Lo-qVkVomXBb_citzakZX9BbeY51iholWs=s96-rw",
    "title": "bKash",
    "companyName": "bKash Limited",
    "description": "Bangladesh's most trusted mobile financial service app. Send and receive money instantly, pay bills, and recharge mobile balance. Access merchant payments and QR code scanning for secure transactions. Monitor account activity and maintain transaction history. Use advanced security features like PIN and biometric authentication. Explore promotional offers, rewards, and cashback opportunities. Connect with customer support for assistance. Manage multiple accounts seamlessly. Transfer funds internationally through partnered services.",
    "size": 80,
    "reviews": 2500000,
    "ratingAvg": 4.6,
    "downloads": 20000000,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1900000 }
    ]
  },
  {
    "id": 16,
    "image": "https://play-lh.googleusercontent.com/9ps_d6nGKQzfbsJfMaFR0RkdwzEdbZV53ReYCS09Eo5MV-GtVylFD-7IHcVktlnz9Mo=w480-h960-rw",
    "title": "Nagad",
    "companyName": "Bangladesh Post Office",
    "description": "Digital financial service for secure money transfers in Bangladesh. Send and receive money instantly, pay utility bills, and top-up mobile balance. Use QR code scanning for safe payments and transfers. Track transaction history and account balance in real-time. Participate in promotions and loyalty rewards programs. Manage multiple financial services within the app. Access fast and secure customer support. Perform bank transfers, receive government payments, and handle business transactions efficiently. Benefit from modern digital banking features tailored for convenience.",
    "size": 70,
    "reviews": 2000000,
    "ratingAvg": 4.5,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 350000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "id": 17,
    "image": "https://play-lh.googleusercontent.com/9ps_d6nGKQzfbsJfMaFR0RkdwzEdbZV53ReYCS09Eo5MV-GtVylFD-7IHcVktlnz9Mo=w480-h960-rw",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "Fast, secure, and free messaging and calls across the world. Send text messages, voice notes, photos, and videos instantly. Make voice and video calls with end-to-end encryption. Create group chats for friends, family, or work teams. Share status updates and view others' statuses. Backup messages to cloud storage for easy recovery. Use WhatsApp Web to chat from your desktop. Utilize stickers, GIFs, and emojis for creative communication. Participate in WhatsApp Business for customer interactions.",
    "size": 120,
    "reviews": 160000000,
    "ratingAvg": 4.6,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 130000000 }
    ]
  },
  {
    "id": 18,
    "image": "https://play-lh.googleusercontent.com/7ynvVIRdhJNAngCg_GI7i8TtH8BqkJYmffeUHsG-mJOdzt1XLvGmbsKuc5Q1SInBjDKN=w480-h960-rw",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "description": "Listen to millions of songs and podcasts for free. Create playlists, follow favorite artists, and discover new music. Access personalized recommendations and curated playlists. Listen offline with premium subscriptions. Explore podcasts on various topics including news, education, and entertainment. Share music with friends and social media platforms. Enjoy high-quality audio and seamless cross-device listening. Participate in exclusive events, concerts, and content releases. Customize your listening experience with playlists, favorites, and radio stations.",
    "size": 110,
    "reviews": 105000000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 65000000 }
    ]
  },
  {
    "id": 19,
    "image": "https://play-lh.googleusercontent.com/JfQNUnohpuq5IP65WN9C109VjLjDEj2tZYlPtComLznQfGeeoesubOaHGBcpZdXKuHU=w480-h960-rw",
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "Chat and make video calls with friends and family instantly. Send messages, photos, and videos in real-time. Make secure voice and video calls with end-to-end encryption. Create group chats for communities or teams. Share stories, reactions, and interactive content. Use Messenger Rooms for group video calls with multiple participants. Integrate with Facebook to connect seamlessly with contacts. Access stickers, GIFs, and emojis to enhance conversations. Receive notifications for messages and calls instantly.",
    "size": 160,
    "reviews": 95000000,
    "ratingAvg": 4.3,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 55000000 }
    ]
  },
  {
    "id": 20,
    "image": "https://play-lh.googleusercontent.com/KSuaRLiI_FlDP8cM4MzJ23ml3og5Hxb9AapaGTMZ2GgR103mvJ3AAnoOFz1yheeQBBI=w480-h960-rw",
    "title": "Gmail",
    "companyName": "Google LLC",
    "description": "Secure and reliable email service from Google. Send and receive emails with advanced spam filtering. Organize emails using labels, folders, and categories. Access Gmail from any device with synchronization. Use integrated Google Workspace tools like Calendar, Drive, and Meet. Search emails quickly with powerful search functions. Enable two-factor authentication and security settings for privacy. Archive, star, and prioritize important messages. Collaborate seamlessly with attachments and shared documents.",
    "size": 130,
    "reviews": 120000000,
    "ratingAvg": 4.5,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 23000000 },
      { "name": "5 star", "count": 83000000 }
    ]
  }
]
